###################################################################

# Created by write_sdc on Tue Dec  2 18:50:26 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
create_clock [get_ports clk]  -period 0  -waveform {0 0}
set_input_delay -clock clk  0.1  [get_ports {addressA[4]}]
set_input_delay -clock clk  0.1  [get_ports {addressA[3]}]
set_input_delay -clock clk  0.1  [get_ports {addressA[2]}]
set_input_delay -clock clk  0.1  [get_ports {addressA[1]}]
set_input_delay -clock clk  0.1  [get_ports {addressA[0]}]
set_input_delay -clock clk  0.1  [get_ports {addressB[4]}]
set_input_delay -clock clk  0.1  [get_ports {addressB[3]}]
set_input_delay -clock clk  0.1  [get_ports {addressB[2]}]
set_input_delay -clock clk  0.1  [get_ports {addressB[1]}]
set_input_delay -clock clk  0.1  [get_ports {addressB[0]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[31]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[30]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[29]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[28]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[27]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[26]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[25]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[24]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[23]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[22]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[21]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[20]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[19]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[18]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[17]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[16]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[15]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[14]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[13]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[12]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[11]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[10]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[9]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[8]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[7]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[6]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[5]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[4]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[3]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[2]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[1]}]
set_input_delay -clock clk  0.1  [get_ports {dataIn[0]}]
set_input_delay -clock clk  0.1  [get_ports asel]
set_input_delay -clock clk  0.1  [get_ports bsel]
set_input_delay -clock clk  0.1  [get_ports {opsel[1]}]
set_input_delay -clock clk  0.1  [get_ports {opsel[0]}]
set_input_delay -clock clk  0.1  [get_ports {outsel[1]}]
set_input_delay -clock clk  0.1  [get_ports {outsel[0]}]
set_input_delay -clock clk  0.1  [get_ports oen]
set_output_delay -clock clk  0.1  [get_ports {outPut[31]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[30]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[29]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[28]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[27]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[26]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[25]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[24]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[23]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[22]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[21]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[20]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[19]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[18]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[17]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[16]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[15]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[14]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[13]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[12]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[11]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[10]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[9]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[8]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[7]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[6]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[5]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[4]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[3]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[2]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[1]}]
set_output_delay -clock clk  0.1  [get_ports {outPut[0]}]
set_output_delay -clock clk  0.1  [get_ports over]
